[Killed] BlockStatement
src/domain/erros/DadosInvalidosErro.js:10:29
  * validação em si (Separation of Concerns).
  */
 class DadosInvalidosError extends Error {
-  constructor(motivos = []) {
-    super(`Dados inválidos para checkout: ${motivos.join('; ')}`);
-    this.name = 'DadosInvalidosError';
-    this.motivos = motivos;
-  }
+  constructor(motivos = []) {}
 }
 
killedBy: API de checkout retorna 400 e não acessa dependências para payload inválido
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 500

[NoCoverage] ArrayDeclaration
src/domain/erros/DadosInvalidosErro.js:10:25
  * validação em si (Separation of Concerns).
  */
 class DadosInvalidosError extends Error {
-  constructor(motivos = []) {
+  constructor(motivos = ["Stryker was here"]) {
     super(`Dados inválidos para checkout: ${motivos.join('; ')}`);
     this.name = 'DadosInvalidosError';
