[Killed] ArrowFunction
src/infra/ConfiguracaoCheckoutCache.js:1:43
-const esperarPadrao = (ms) => new Promise((resolve) => setTimeout(resolve, ms));
+const esperarPadrao = (ms) => new Promise(() => undefined);
 
 class ConfiguracaoCheckoutCache {
killedBy: ConfiguracaoCheckoutCache cache miss concorrente consulta o banco uma única vez
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Survived] ArrowFunction
src/infra/ConfiguracaoCheckoutCache.js:1:23
-const esperarPadrao = (ms) => new Promise((resolve) => setTimeout(resolve, ms));
+const esperarPadrao = () => undefined;
 
 class ConfiguracaoCheckoutCache {

[Killed] BlockStatement
src/infra/ConfiguracaoCheckoutCache.js:13:6
     operacaoTimeoutMs = 200,
     aguardar = esperarPadrao,
     aleatorio = Math.random,
-  }) {
-    this.redis = redis;
-    this.repository = repository;
-    this.metricas = metricas;
-    this.ttlSegundos = ttlSegundos;
-    this.lockTtlMs = lockTtlMs;
-    this.operacaoTimeoutMs = operacaoTimeoutMs;
-    this.aguardar = aguardar;
-    this.aleatorio = aleatorio;
-    this.ultimaConfiguracao = null;
-    this.carregamentoEmAndamento = null;
-    this.cacheKey = 'checkout:config:v1';
-    this.lockKey = `${this.cacheKey}:lock`;
-  }
+  }) {}
 
   async obter() {
killedBy: ConfiguracaoCheckoutCache cache miss concorrente consulta o banco uma única vez
statusReason: TypeError: Cannot read properties of undefined (reading 'cacheFallback')

[Killed] StringLiteral
src/infra/ConfiguracaoCheckoutCache.js:24:21
     this.aleatorio = aleatorio;
     this.ultimaConfiguracao = null;
     this.carregamentoEmAndamento = null;
-    this.cacheKey = 'checkout:config:v1';
+    this.cacheKey = "";
     this.lockKey = `${this.cacheKey}:lock`;
   }
killedBy: ConfiguracaoCheckoutCache cache hit evita banco e atualiza métricas
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"pagamentosAtivos": true}
Received: undefined

[Killed] BlockStatement
src/infra/ConfiguracaoCheckoutCache.js:28:17
     this.lockKey = `${this.cacheKey}:lock`;
   }
 
-  async obter() {
-    if (this.carregamentoEmAndamento) return this.carregamentoEmAndamento;
-
-    try {
-      const valor = await this._redis(this.redis.get(this.cacheKey));
-      if (valor) {
-        this.metricas.cacheHit += 1;
-        this.ultimaConfiguracao = JSON.parse(valor);
-        return this.ultimaConfiguracao;
-      }
-      this.metricas.cacheMiss += 1;
-    } catch (erro) {
-      this.metricas.cacheFallback += 1;
-      if (this.ultimaConfiguracao) return this.ultimaConfiguracao;
-      return this.repository.obter();
-    }
-
-    this.carregamentoEmAndamento = this._carregarProtegido();
-    try {
-      return await this.carregamentoEmAndamento;
-    } finally {
-      this.carregamentoEmAndamento = null;
-    }
-  }
+  async obter() {}
 
   async _carregarProtegido() {
killedBy: ConfiguracaoCheckoutCache cache miss concorrente consulta o banco uma única vez
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] ConditionalExpression
src/infra/ConfiguracaoCheckoutCache.js:29:9
   }
 
   async obter() {
-    if (this.carregamentoEmAndamento) return this.carregamentoEmAndamento;
+    if (true) return this.carregamentoEmAndamento;
 
     try {
killedBy: ConfiguracaoCheckoutCache cache miss concorrente consulta o banco uma única vez
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Survived] ConditionalExpression
src/infra/ConfiguracaoCheckoutCache.js:29:9
   }
 
   async obter() {
-    if (this.carregamentoEmAndamento) return this.carregamentoEmAndamento;
+    if (false) return this.carregamentoEmAndamento;
 
     try {

[Killed] BlockStatement
src/infra/ConfiguracaoCheckoutCache.js:31:9
   async obter() {
     if (this.carregamentoEmAndamento) return this.carregamentoEmAndamento;
 
-    try {
-      const valor = await this._redis(this.redis.get(this.cacheKey));
-      if (valor) {
-        this.metricas.cacheHit += 1;
-        this.ultimaConfiguracao = JSON.parse(valor);
-        return this.ultimaConfiguracao;
-      }
-      this.metricas.cacheMiss += 1;
-    } catch (erro) {
+    try {} catch (erro) {
       this.metricas.cacheFallback += 1;
       if (this.ultimaConfiguracao) return this.ultimaConfiguracao;
killedBy: ConfiguracaoCheckoutCache retorna last known good quando Redis falha
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 2

[Killed] ConditionalExpression
src/infra/ConfiguracaoCheckoutCache.js:33:11
 
     try {
       const valor = await this._redis(this.redis.get(this.cacheKey));
-      if (valor) {
+      if (true) {
         this.metricas.cacheHit += 1;
         this.ultimaConfiguracao = JSON.parse(valor);
killedBy: ConfiguracaoCheckoutCache cache miss concorrente consulta o banco uma única vez
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] ConditionalExpression
src/infra/ConfiguracaoCheckoutCache.js:33:11
 
     try {
       const valor = await this._redis(this.redis.get(this.cacheKey));
-      if (valor) {
+      if (false) {
         this.metricas.cacheHit += 1;
         this.ultimaConfiguracao = JSON.parse(valor);
killedBy: ConfiguracaoCheckoutCache cache hit evita banco e atualiza métricas
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"pagamentosAtivos": true}
Received: undefined

[Killed] AssignmentOperator
src/infra/ConfiguracaoCheckoutCache.js:34:9
     try {
       const valor = await this._redis(this.redis.get(this.cacheKey));
       if (valor) {
-        this.metricas.cacheHit += 1;
+        this.metricas.cacheHit -= 1;
         this.ultimaConfiguracao = JSON.parse(valor);
         return this.ultimaConfiguracao;
killedBy: ConfiguracaoCheckoutCache cache hit evita banco e atualiza métricas
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: -1

[Killed] AssignmentOperator
src/infra/ConfiguracaoCheckoutCache.js:38:7
         this.ultimaConfiguracao = JSON.parse(valor);
         return this.ultimaConfiguracao;
       }
-      this.metricas.cacheMiss += 1;
+      this.metricas.cacheMiss -= 1;
     } catch (erro) {
       this.metricas.cacheFallback += 1;
killedBy: ConfiguracaoCheckoutCache usa lock com TTL, grava cache com TTL e libera apenas o próprio lock
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: -1

[Killed] BlockStatement
src/infra/ConfiguracaoCheckoutCache.js:39:20
         return this.ultimaConfiguracao;
       }
       this.metricas.cacheMiss += 1;
-    } catch (erro) {
-      this.metricas.cacheFallback += 1;
-      if (this.ultimaConfiguracao) return this.ultimaConfiguracao;
-      return this.repository.obter();
-    }
+    } catch (erro) {}
 
     this.carregamentoEmAndamento = this._carregarProtegido();
killedBy: ConfiguracaoCheckoutCache retorna last known good quando Redis falha
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 2

[Killed] AssignmentOperator
src/infra/ConfiguracaoCheckoutCache.js:40:7
       }
       this.metricas.cacheMiss += 1;
     } catch (erro) {
-      this.metricas.cacheFallback += 1;
+      this.metricas.cacheFallback -= 1;
       if (this.ultimaConfiguracao) return this.ultimaConfiguracao;
       return this.repository.obter();
killedBy: ConfiguracaoCheckoutCache retorna last known good quando Redis falha
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: -1

[Killed] ConditionalExpression
src/infra/ConfiguracaoCheckoutCache.js:41:11
       this.metricas.cacheMiss += 1;
     } catch (erro) {
       this.metricas.cacheFallback += 1;
-      if (this.ultimaConfiguracao) return this.ultimaConfiguracao;
+      if (false) return this.ultimaConfiguracao;
       return this.repository.obter();
     }
killedBy: ConfiguracaoCheckoutCache retorna last known good quando Redis falha
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 2

[Killed] ConditionalExpression
src/infra/ConfiguracaoCheckoutCache.js:41:11
       this.metricas.cacheMiss += 1;
     } catch (erro) {
       this.metricas.cacheFallback += 1;
-      if (this.ultimaConfiguracao) return this.ultimaConfiguracao;
+      if (true) return this.ultimaConfiguracao;
       return this.repository.obter();
     }
killedBy: ConfiguracaoCheckoutCache consulta banco diretamente quando Redis falha sem last known good
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"versao": 3}
Received: null

[Killed] BlockStatement
src/infra/ConfiguracaoCheckoutCache.js:46:9
     }
 
     this.carregamentoEmAndamento = this._carregarProtegido();
-    try {
-      return await this.carregamentoEmAndamento;
-    } finally {
+    try {} finally {
       this.carregamentoEmAndamento = null;
     }
killedBy: ConfiguracaoCheckoutCache cache miss concorrente consulta o banco uma única vez
statusReason: TypeError: Cannot read properties of undefined (reading 'pagamentosAtivos')

[Killed] BlockStatement
src/infra/ConfiguracaoCheckoutCache.js:48:15
     this.carregamentoEmAndamento = this._carregarProtegido();
     try {
       return await this.carregamentoEmAndamento;
-    } finally {
-      this.carregamentoEmAndamento = null;
-    }
+    } finally {}
   }
 
killedBy: ConfiguracaoCheckoutCache retorna last known good quando Redis falha
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] StringLiteral
src/infra/ConfiguracaoCheckoutCache.js:54:19
   }
 
   async _carregarProtegido() {
-    const token = `${process.pid}-${Date.now()}-${this.aleatorio()}`;
+    const token = ``;
     let adquiriuLock = false;
 
killedBy: ConfiguracaoCheckoutCache usa lock com TTL, grava cache com TTL e libera apenas o próprio lock
statusReason: Error: expect(jest.fn()).toHaveBeenNthCalledWith(n, ...expected)

n: 1
Expected: "checkout:config:v1:lock", StringMatching /^\d+-\d+-0$/, {"NX": true, "PX": 900}
Received
->     1
          "checkout:config:v1:lock",
          "",

[Survived] BooleanLiteral
src/infra/ConfiguracaoCheckoutCache.js:55:24
 
   async _carregarProtegido() {
     const token = `${process.pid}-${Date.now()}-${this.aleatorio()}`;
-    let adquiriuLock = false;
+    let adquiriuLock = true;
 
     try {

[Killed] BlockStatement
src/infra/ConfiguracaoCheckoutCache.js:57:9
     const token = `${process.pid}-${Date.now()}-${this.aleatorio()}`;
     let adquiriuLock = false;
 
-    try {
-      adquiriuLock = (await this._redis(this.redis.set(this.lockKey, token, {
-        NX: true,
-        PX: this.lockTtlMs,
-      }))) === 'OK';
-    } catch (erro) {
+    try {} catch (erro) {
       return this._fallbackOuBanco();
     }
killedBy: ConfiguracaoCheckoutCache usa lock com TTL, grava cache com TTL e libera apenas o próprio lock
statusReason: Error: expect(jest.fn()).toHaveBeenNthCalledWith(n, ...expected)

n: 1
- Expected
+ Received

- "checkout:config:v1:lock",
+ "checkout:config:v1",

[Killed] ConditionalExpression
src/infra/ConfiguracaoCheckoutCache.js:58:22
     let adquiriuLock = false;
 
     try {
-      adquiriuLock = (await this._redis(this.redis.set(this.lockKey, token, {
-        NX: true,
-        PX: this.lockTtlMs,
-      }))) === 'OK';
+      adquiriuLock = false;
     } catch (erro) {
       return this._fallbackOuBanco();
killedBy: ConfiguracaoCheckoutCache usa lock com TTL, grava cache com TTL e libera apenas o próprio lock
statusReason: Error: expect(jest.fn()).toHaveBeenNthCalledWith(n, ...expected)

n: 1
- Expected
+ Received

- "checkout:config:v1:lock",
+ "checkout:config:v1",

[Killed] ConditionalExpression
src/infra/ConfiguracaoCheckoutCache.js:58:22
     let adquiriuLock = false;
 
     try {
-      adquiriuLock = (await this._redis(this.redis.set(this.lockKey, token, {
-        NX: true,
-        PX: this.lockTtlMs,
-      }))) === 'OK';
+      adquiriuLock = true;
     } catch (erro) {
       return this._fallbackOuBanco();
killedBy: ConfiguracaoCheckoutCache cache miss concorrente consulta o banco uma única vez
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 100

[Killed] BooleanLiteral
src/infra/ConfiguracaoCheckoutCache.js:59:13
 
     try {
       adquiriuLock = (await this._redis(this.redis.set(this.lockKey, token, {
-        NX: true,
+        NX: false,
         PX: this.lockTtlMs,
       }))) === 'OK';
killedBy: ConfiguracaoCheckoutCache cache miss concorrente consulta o banco uma única vez
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 100

[NoCoverage] BlockStatement
src/infra/ConfiguracaoCheckoutCache.js:62:20
         NX: true,
         PX: this.lockTtlMs,
       }))) === 'OK';
-    } catch (erro) {
-      return this._fallbackOuBanco();
-    }
+    } catch (erro) {}
 
     try {

[Killed] BlockStatement
src/infra/ConfiguracaoCheckoutCache.js:66:9
       return this._fallbackOuBanco();
     }
 
-    try {
-      if (!adquiriuLock) {
-        for (let tentativa = 0; tentativa < 5; tentativa++) {
-          await this.aguardar((25 * (2 ** tentativa)) + Math.floor(this.aleatorio() * 25));
-          const valor = await this._redis(this.redis.get(this.cacheKey));
-          if (valor) {
-            this.metricas.cacheHit += 1;
-            this.ultimaConfiguracao = JSON.parse(valor);
-            return this.ultimaConfiguracao;
-          }
-        }
-      }
-
-      const configuracao = await this.repository.obter();
-      this.ultimaConfiguracao = configuracao;
-      try {
-        await this._redis(this.redis.set(this.cacheKey, JSON.stringify(configuracao), {
-          EX: this.ttlSegundos,
-        }));
-      } catch (erro) {
-        this.metricas.cacheFallback += 1;
-      }
-      return configuracao;
-    } finally {
+    try {} finally {
       if (adquiriuLock) await this._liberarLock(token);
     }
killedBy: ConfiguracaoCheckoutCache cache miss concorrente consulta o banco uma única vez
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] ConditionalExpression
src/infra/ConfiguracaoCheckoutCache.js:67:11
     }
 
     try {
-      if (!adquiriuLock) {
+      if (false) {
         for (let tentativa = 0; tentativa < 5; tentativa++) {
           await this.aguardar((25 * (2 ** tentativa)) + Math.floor(this.aleatorio() * 25));
killedBy: ConfiguracaoCheckoutCache cache miss concorrente consulta o banco uma única vez
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 100

[Killed] BooleanLiteral
src/infra/ConfiguracaoCheckoutCache.js:67:11
     }
 
     try {
-      if (!adquiriuLock) {
+      if (adquiriuLock) {
         for (let tentativa = 0; tentativa < 5; tentativa++) {
           await this.aguardar((25 * (2 ** tentativa)) + Math.floor(this.aleatorio() * 25));
killedBy: ConfiguracaoCheckoutCache cache miss concorrente consulta o banco uma única vez
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 99

[Killed] UpdateOperator
src/infra/ConfiguracaoCheckoutCache.js:68:48
 
     try {
       if (!adquiriuLock) {
-        for (let tentativa = 0; tentativa < 5; tentativa++) {
+        for (let tentativa = 0; tentativa < 5; tentativa--) {
           await this.aguardar((25 * (2 ** tentativa)) + Math.floor(this.aleatorio() * 25));
           const valor = await this._redis(this.redis.get(this.cacheKey));
killedBy: ConfiguracaoCheckoutCache aguarda o detentor do lock preencher o cache sem consultar banco
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    25,
-   50,

[Killed] BlockStatement
src/infra/ConfiguracaoCheckoutCache.js:68:61
 
     try {
       if (!adquiriuLock) {
-        for (let tentativa = 0; tentativa < 5; tentativa++) {
-          await this.aguardar((25 * (2 ** tentativa)) + Math.floor(this.aleatorio() * 25));
-          const valor = await this._redis(this.redis.get(this.cacheKey));
-          if (valor) {
-            this.metricas.cacheHit += 1;
-            this.ultimaConfiguracao = JSON.parse(valor);
-            return this.ultimaConfiguracao;
-          }
-        }
+        for (let tentativa = 0; tentativa < 5; tentativa++) {}
       }
 
killedBy: ConfiguracaoCheckoutCache cache miss concorrente consulta o banco uma única vez
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 100

[Killed] ArithmeticOperator
src/infra/ConfiguracaoCheckoutCache.js:69:32
     try {
       if (!adquiriuLock) {
         for (let tentativa = 0; tentativa < 5; tentativa++) {
-          await this.aguardar((25 * (2 ** tentativa)) + Math.floor(this.aleatorio() * 25));
+          await this.aguardar((25 / 2 ** tentativa) + Math.floor(this.aleatorio() * 25));
           const valor = await this._redis(this.redis.get(this.cacheKey));
           if (valor) {
killedBy: ConfiguracaoCheckoutCache aguarda o detentor do lock preencher o cache sem consultar banco
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    25,
-   50,

[Survived] ArithmeticOperator
src/infra/ConfiguracaoCheckoutCache.js:69:31
     try {
       if (!adquiriuLock) {
         for (let tentativa = 0; tentativa < 5; tentativa++) {
-          await this.aguardar((25 * (2 ** tentativa)) + Math.floor(this.aleatorio() * 25));
+          await this.aguardar(25 * 2 ** tentativa - Math.floor(this.aleatorio() * 25));
           const valor = await this._redis(this.redis.get(this.cacheKey));
           if (valor) {

[Killed] BlockStatement
src/infra/ConfiguracaoCheckoutCache.js:71:22
         for (let tentativa = 0; tentativa < 5; tentativa++) {
           await this.aguardar((25 * (2 ** tentativa)) + Math.floor(this.aleatorio() * 25));
           const valor = await this._redis(this.redis.get(this.cacheKey));
-          if (valor) {
-            this.metricas.cacheHit += 1;
-            this.ultimaConfiguracao = JSON.parse(valor);
-            return this.ultimaConfiguracao;
-          }
+          if (valor) {}
         }
       }
killedBy: ConfiguracaoCheckoutCache cache miss concorrente consulta o banco uma única vez
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 100

[Killed] BlockStatement
src/infra/ConfiguracaoCheckoutCache.js:81:11
 
       const configuracao = await this.repository.obter();
       this.ultimaConfiguracao = configuracao;
-      try {
-        await this._redis(this.redis.set(this.cacheKey, JSON.stringify(configuracao), {
-          EX: this.ttlSegundos,
-        }));
-      } catch (erro) {
+      try {} catch (erro) {
         this.metricas.cacheFallback += 1;
       }
killedBy: ConfiguracaoCheckoutCache cache miss concorrente consulta o banco uma única vez
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 100

[Killed] BlockStatement
src/infra/ConfiguracaoCheckoutCache.js:85:22
         await this._redis(this.redis.set(this.cacheKey, JSON.stringify(configuracao), {
           EX: this.ttlSegundos,
         }));
-      } catch (erro) {
-        this.metricas.cacheFallback += 1;
-      }
+      } catch (erro) {}
       return configuracao;
     } finally {
killedBy: ConfiguracaoCheckoutCache mantém configuração carregada se Redis falhar durante a escrita
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] BlockStatement
src/infra/ConfiguracaoCheckoutCache.js:89:15
         this.metricas.cacheFallback += 1;
       }
       return configuracao;
-    } finally {
-      if (adquiriuLock) await this._liberarLock(token);
-    }
+    } finally {}
   }
 
killedBy: ConfiguracaoCheckoutCache usa lock com TTL, grava cache com TTL e libera apenas o próprio lock
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "checkout:config:v1:lock"

Number of calls: 0

[Killed] ConditionalExpression
src/infra/ConfiguracaoCheckoutCache.js:90:11
       }
       return configuracao;
     } finally {
-      if (adquiriuLock) await this._liberarLock(token);
+      if (false) await this._liberarLock(token);
     }
   }
killedBy: ConfiguracaoCheckoutCache usa lock com TTL, grava cache com TTL e libera apenas o próprio lock
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "checkout:config:v1:lock"

Number of calls: 0

[Survived] ConditionalExpression
src/infra/ConfiguracaoCheckoutCache.js:90:11
       }
       return configuracao;
     } finally {
-      if (adquiriuLock) await this._liberarLock(token);
+      if (true) await this._liberarLock(token);
     }
   }

[NoCoverage] BlockStatement
src/infra/ConfiguracaoCheckoutCache.js:94:28
     }
   }
 
-  async _fallbackOuBanco() {
-    this.metricas.cacheFallback += 1;
-    if (this.ultimaConfiguracao) return this.ultimaConfiguracao;
-
-    return this.repository.obter();
-  }
+  async _fallbackOuBanco() {}
 
   async _liberarLock(token) {

[NoCoverage] AssignmentOperator
src/infra/ConfiguracaoCheckoutCache.js:95:5
   }
 
   async _fallbackOuBanco() {
-    this.metricas.cacheFallback += 1;
+    this.metricas.cacheFallback -= 1;
     if (this.ultimaConfiguracao) return this.ultimaConfiguracao;
 

[Killed] BlockStatement
src/infra/ConfiguracaoCheckoutCache.js:101:29
     return this.repository.obter();
   }
 
-  async _liberarLock(token) {
-    try {
-      const atual = await this._redis(this.redis.get(this.lockKey));
-      if (atual === token) await this._redis(this.redis.del(this.lockKey));
-    } catch (erro) {
-      // O TTL remove o lock mesmo se o Redis falhar durante a liberação.
-    }
-  }
+  async _liberarLock(token) {}
 
   async limpar() {
killedBy: ConfiguracaoCheckoutCache usa lock com TTL, grava cache com TTL e libera apenas o próprio lock
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "checkout:config:v1:lock"

Number of calls: 0

[Killed] BlockStatement
src/infra/ConfiguracaoCheckoutCache.js:102:9
   }
 
   async _liberarLock(token) {
-    try {
-      const atual = await this._redis(this.redis.get(this.lockKey));
-      if (atual === token) await this._redis(this.redis.del(this.lockKey));
-    } catch (erro) {
+    try {} catch (erro) {
       // O TTL remove o lock mesmo se o Redis falhar durante a liberação.
     }
killedBy: ConfiguracaoCheckoutCache usa lock com TTL, grava cache com TTL e libera apenas o próprio lock
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "checkout:config:v1:lock"

Number of calls: 0

[Killed] EqualityOperator
src/infra/ConfiguracaoCheckoutCache.js:104:11
   async _liberarLock(token) {
     try {
       const atual = await this._redis(this.redis.get(this.lockKey));
-      if (atual === token) await this._redis(this.redis.del(this.lockKey));
+      if (atual !== token) await this._redis(this.redis.del(this.lockKey));
     } catch (erro) {
       // O TTL remove o lock mesmo se o Redis falhar durante a liberação.
killedBy: ConfiguracaoCheckoutCache usa lock com TTL, grava cache com TTL e libera apenas o próprio lock
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "checkout:config:v1:lock"

Number of calls: 0

[Killed] ConditionalExpression
src/infra/ConfiguracaoCheckoutCache.js:104:11
   async _liberarLock(token) {
     try {
       const atual = await this._redis(this.redis.get(this.lockKey));
-      if (atual === token) await this._redis(this.redis.del(this.lockKey));
+      if (false) await this._redis(this.redis.del(this.lockKey));
     } catch (erro) {
       // O TTL remove o lock mesmo se o Redis falhar durante a liberação.
killedBy: ConfiguracaoCheckoutCache usa lock com TTL, grava cache com TTL e libera apenas o próprio lock
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "checkout:config:v1:lock"

Number of calls: 0

[Killed] BlockStatement
src/infra/ConfiguracaoCheckoutCache.js:110:18
     }
   }
 
-  async limpar() {
-    await this._redis(this.redis.del(this.cacheKey));
-  }
+  async limpar() {}
 
   _redis(operacao) {
killedBy: ConfiguracaoCheckoutCache limpar remove a chave real do cache
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "checkout:config:v1"

Number of calls: 0

[Timeout] BlockStatement
src/infra/ConfiguracaoCheckoutCache.js:115:45
   }
 
   _redis(operacao) {
-    return new Promise((resolve, reject) => {
-      const timeout = setTimeout(
-        () => reject(new Error('redis_timeout')),
-        this.operacaoTimeoutMs,
-      );
-      Promise.resolve(operacao).then(
-        (valor) => {
-          clearTimeout(timeout);
-          resolve(valor);
-        },
-        (erro) => {
-          clearTimeout(timeout);
-          reject(erro);
-        },
-      );
-    });
+    return new Promise((resolve, reject) => {});
   }
 }

[Survived] ArrowFunction
src/infra/ConfiguracaoCheckoutCache.js:117:9
   _redis(operacao) {
     return new Promise((resolve, reject) => {
       const timeout = setTimeout(
-        () => reject(new Error('redis_timeout')),
+        () => undefined,
         this.operacaoTimeoutMs,
       );

[Killed] BlockStatement
src/infra/ConfiguracaoCheckoutCache.js:121:20
         this.operacaoTimeoutMs,
       );
       Promise.resolve(operacao).then(
-        (valor) => {
-          clearTimeout(timeout);
-          resolve(valor);
-        },
+        (valor) => {},
         (erro) => {
           clearTimeout(timeout);
killedBy: ConfiguracaoCheckoutCache cache miss concorrente consulta o banco uma única vez
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 100

[Survived] BlockStatement
src/infra/ConfiguracaoCheckoutCache.js:125:19
           clearTimeout(timeout);
           resolve(valor);
         },
-        (erro) => {
-          clearTimeout(timeout);
-          reject(erro);
-        },
+        (erro) => {},
       );
     });

[Killed] ObjectLiteral
src/infra/ConfiguracaoCheckoutCache.js:134:18
   }
 }
 
-module.exports = { ConfiguracaoCheckoutCache };
+module.exports = {};
 
killedBy: ConfiguracaoCheckoutCache cache miss concorrente consulta o banco uma única vez
statusReason: TypeError: ConfiguracaoCheckoutCache is not a constructor
