[Killed] StringLiteral
src/infra/GatewayPagamentoClient.js:5:25
 const { PagamentoRecusado } = require('../resultados/PagamentoRecusado');
 const { PagamentoComErroInfraestrutura } = require('../resultados/PagamentoComErroInfraestrutura');
 
-const STATUS_APROVADO = 'APROVADO';
+const STATUS_APROVADO = "";
 
 class TimeoutGatewayError extends Error {
killedBy: GatewayPagamentoClient interpreta aprovação e recusa
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 402

[Killed] BlockStatement
src/infra/GatewayPagamentoClient.js:8:26
 const STATUS_APROVADO = 'APROVADO';
 
 class TimeoutGatewayError extends Error {
-  constructor(timeoutMs) {
-    super(`Timeout: gateway de pagamento não respondeu em ${timeoutMs}ms`);
-    this.name = 'TimeoutGatewayError';
-  }
+  constructor(timeoutMs) {}
 }
 
killedBy: GatewayPagamentoClient interrompe chamada pendente no timeout
statusReason: ReferenceError: Must call super constructor in derived class before accessing 'this' or returning from derived constructor

[Killed] StringLiteral
src/infra/GatewayPagamentoClient.js:9:11
 
 class TimeoutGatewayError extends Error {
   constructor(timeoutMs) {
-    super(`Timeout: gateway de pagamento não respondeu em ${timeoutMs}ms`);
+    super(``);
     this.name = 'TimeoutGatewayError';
   }
killedBy: GatewayPagamentoClient interrompe chamada pendente no timeout
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Timeout: gateway de pagamento não respondeu em 5ms"
Received: ""

[Survived] StringLiteral
src/infra/GatewayPagamentoClient.js:10:17
 class TimeoutGatewayError extends Error {
   constructor(timeoutMs) {
     super(`Timeout: gateway de pagamento não respondeu em ${timeoutMs}ms`);
-    this.name = 'TimeoutGatewayError';
+    this.name = "";
   }
 }

[NoCoverage] ArrowFunction
src/infra/GatewayPagamentoClient.js:14:44
   }
 }
 
-const aguardarPadrao = (ms) => new Promise((resolve) => setTimeout(resolve, ms));
+const aguardarPadrao = (ms) => new Promise(() => undefined);
 
 /**

[Survived] ArrowFunction
src/infra/GatewayPagamentoClient.js:14:24
   }
 }
 
-const aguardarPadrao = (ms) => new Promise((resolve) => setTimeout(resolve, ms));
+const aguardarPadrao = () => undefined;
 
 /**

[Killed] BlockStatement
src/infra/GatewayPagamentoClient.js:27:62
  * apenas recebe de volta um ResultadoPagamento já interpretado.
  */
 class GatewayPagamentoClient {
-  constructor(gatewayPagamento, circuitBreaker, opcoes = {}) {
-    this.gatewayPagamento = gatewayPagamento;
-    this.circuitBreaker = circuitBreaker;
-
-    this.timeoutMs = opcoes.timeoutMs ?? 2000;
-    this.orcamentoTotalMs = opcoes.orcamentoTotalMs ?? 2500;
-    this.maxRetentativas = opcoes.maxRetentativas ?? 3;
-    this.intervaloBackoffMs = opcoes.intervaloBackoffMs ?? 100;
-    this.jitterMs = opcoes.jitterMs ?? 100;
-    this._aguardar = opcoes.aguardar ?? aguardarPadrao;
-    this._agora = opcoes.agora ?? (() => Date.now());
-    this._aleatorio = opcoes.aleatorio ?? Math.random;
-  }
+  constructor(gatewayPagamento, circuitBreaker, opcoes = {}) {}
 
   /** @param {import('../domain/Pedido').Pedido} pedido */
killedBy: GatewayPagamentoClient interpreta aprovação e recusa
statusReason: TypeError: Cannot read properties of undefined (reading 'estaAberto')

[Killed] LogicalOperator
src/infra/GatewayPagamentoClient.js:31:22
     this.gatewayPagamento = gatewayPagamento;
     this.circuitBreaker = circuitBreaker;
 
-    this.timeoutMs = opcoes.timeoutMs ?? 2000;
+    this.timeoutMs = opcoes.timeoutMs && 2000;
     this.orcamentoTotalMs = opcoes.orcamentoTotalMs ?? 2500;
     this.maxRetentativas = opcoes.maxRetentativas ?? 3;
killedBy: GatewayPagamentoClient interrompe chamada pendente no timeout
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Timeout: gateway de pagamento não respondeu em 5ms"
Received: "Timeout: gateway de pagamento não respondeu em 10ms"

[Killed] LogicalOperator
src/infra/GatewayPagamentoClient.js:32:29
     this.circuitBreaker = circuitBreaker;
 
     this.timeoutMs = opcoes.timeoutMs ?? 2000;
-    this.orcamentoTotalMs = opcoes.orcamentoTotalMs ?? 2500;
+    this.orcamentoTotalMs = opcoes.orcamentoTotalMs && 2500;
     this.maxRetentativas = opcoes.maxRetentativas ?? 3;
     this.intervaloBackoffMs = opcoes.intervaloBackoffMs ?? 100;
killedBy: GatewayPagamentoClient expõe os valores padrão da política resiliente
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2500
Received: undefined

[Killed] LogicalOperator
src/infra/GatewayPagamentoClient.js:33:28
 
     this.timeoutMs = opcoes.timeoutMs ?? 2000;
     this.orcamentoTotalMs = opcoes.orcamentoTotalMs ?? 2500;
-    this.maxRetentativas = opcoes.maxRetentativas ?? 3;
+    this.maxRetentativas = opcoes.maxRetentativas && 3;
     this.intervaloBackoffMs = opcoes.intervaloBackoffMs ?? 100;
     this.jitterMs = opcoes.jitterMs ?? 100;
killedBy: GatewayPagamentoClient interpreta aprovação e recusa
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 500

[Killed] LogicalOperator
src/infra/GatewayPagamentoClient.js:34:31
     this.timeoutMs = opcoes.timeoutMs ?? 2000;
     this.orcamentoTotalMs = opcoes.orcamentoTotalMs ?? 2500;
     this.maxRetentativas = opcoes.maxRetentativas ?? 3;
-    this.intervaloBackoffMs = opcoes.intervaloBackoffMs ?? 100;
+    this.intervaloBackoffMs = opcoes.intervaloBackoffMs && 100;
     this.jitterMs = opcoes.jitterMs ?? 100;
     this._aguardar = opcoes.aguardar ?? aguardarPadrao;
killedBy: GatewayPagamentoClient repete com backoff exponencial e recupera na segunda chamada
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   25,
+   100,

[Killed] LogicalOperator
src/infra/GatewayPagamentoClient.js:35:21
     this.orcamentoTotalMs = opcoes.orcamentoTotalMs ?? 2500;
     this.maxRetentativas = opcoes.maxRetentativas ?? 3;
     this.intervaloBackoffMs = opcoes.intervaloBackoffMs ?? 100;
-    this.jitterMs = opcoes.jitterMs ?? 100;
+    this.jitterMs = opcoes.jitterMs && 100;
     this._aguardar = opcoes.aguardar ?? aguardarPadrao;
     this._agora = opcoes.agora ?? (() => Date.now());
killedBy: GatewayPagamentoClient usa backoff exponencial e jitter nas tentativas sucessivas
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
-   25,
-   45,

[Killed] LogicalOperator
src/infra/GatewayPagamentoClient.js:36:22
     this.maxRetentativas = opcoes.maxRetentativas ?? 3;
     this.intervaloBackoffMs = opcoes.intervaloBackoffMs ?? 100;
     this.jitterMs = opcoes.jitterMs ?? 100;
-    this._aguardar = opcoes.aguardar ?? aguardarPadrao;
+    this._aguardar = opcoes.aguardar && aguardarPadrao;
     this._agora = opcoes.agora ?? (() => Date.now());
     this._aleatorio = opcoes.aleatorio ?? Math.random;
killedBy: GatewayPagamentoClient repete com backoff exponencial e recupera na segunda chamada
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Array [
-   25,
- ]

[Killed] LogicalOperator
src/infra/GatewayPagamentoClient.js:37:19
     this.intervaloBackoffMs = opcoes.intervaloBackoffMs ?? 100;
     this.jitterMs = opcoes.jitterMs ?? 100;
     this._aguardar = opcoes.aguardar ?? aguardarPadrao;
-    this._agora = opcoes.agora ?? (() => Date.now());
+    this._agora = opcoes.agora && (() => Date.now());
     this._aleatorio = opcoes.aleatorio ?? Math.random;
   }
killedBy: GatewayPagamentoClient interpreta aprovação e recusa
statusReason: TypeError: this._agora is not a function

[Killed] ArrowFunction
src/infra/GatewayPagamentoClient.js:37:36
     this.intervaloBackoffMs = opcoes.intervaloBackoffMs ?? 100;
     this.jitterMs = opcoes.jitterMs ?? 100;
     this._aguardar = opcoes.aguardar ?? aguardarPadrao;
-    this._agora = opcoes.agora ?? (() => Date.now());
+    this._agora = opcoes.agora ?? (() => undefined);
     this._aleatorio = opcoes.aleatorio ?? Math.random;
   }
killedBy: GatewayPagamentoClient interrompe chamada pendente no timeout
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Timeout: gateway de pagamento não respondeu em 5ms"
Received: "Timeout: gateway de pagamento não respondeu em NaNms"

[Killed] LogicalOperator
src/infra/GatewayPagamentoClient.js:38:23
     this.jitterMs = opcoes.jitterMs ?? 100;
     this._aguardar = opcoes.aguardar ?? aguardarPadrao;
     this._agora = opcoes.agora ?? (() => Date.now());
-    this._aleatorio = opcoes.aleatorio ?? Math.random;
+    this._aleatorio = opcoes.aleatorio && Math.random;
   }
 
killedBy: GatewayPagamentoClient repete com backoff exponencial e recupera na segunda chamada
statusReason: TypeError: this._aleatorio is not a function

[Killed] BlockStatement
src/infra/GatewayPagamentoClient.js:43:43
 
   /** @param {import('../domain/Pedido').Pedido} pedido */
   async cobrar(pedido) {
-    if (this.circuitBreaker.estaAberto()) {
-      return new PagamentoComErroInfraestrutura('circuit_breaker_aberto');
-    }
+    if (this.circuitBreaker.estaAberto()) {}
 
     let ultimaFalha = null;
killedBy: GatewayPagamentoClient não chama a rede quando o circuit breaker está aberto
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "circuit_breaker_aberto"
Received: "Cannot read properties of undefined (reading 'then')"

[Killed] ConditionalExpression
src/infra/GatewayPagamentoClient.js:43:9
 
   /** @param {import('../domain/Pedido').Pedido} pedido */
   async cobrar(pedido) {
-    if (this.circuitBreaker.estaAberto()) {
+    if (false) {
       return new PagamentoComErroInfraestrutura('circuit_breaker_aberto');
     }
killedBy: GatewayPagamentoClient não chama a rede quando o circuit breaker está aberto
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "circuit_breaker_aberto"
Received: "Cannot read properties of undefined (reading 'then')"

[Killed] ArithmeticOperator
src/infra/GatewayPagamentoClient.js:48:29
     }
 
     let ultimaFalha = null;
-    const totalDeChamadas = this.maxRetentativas + 1;
+    const totalDeChamadas = this.maxRetentativas - 1;
     const prazo = this._agora() + this.orcamentoTotalMs;
 
killedBy: GatewayPagamentoClient usa backoff exponencial e jitter nas tentativas sucessivas
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 0

  Array [
    25,
-   45,

[Killed] ArithmeticOperator
src/infra/GatewayPagamentoClient.js:49:19
 
     let ultimaFalha = null;
     const totalDeChamadas = this.maxRetentativas + 1;
-    const prazo = this._agora() + this.orcamentoTotalMs;
+    const prazo = this._agora() - this.orcamentoTotalMs;
 
     for (let tentativa = 1; tentativa <= totalDeChamadas; tentativa++) {
killedBy: GatewayPagamentoClient interpreta aprovação e recusa
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 500

[Killed] EqualityOperator
src/infra/GatewayPagamentoClient.js:51:29
     const totalDeChamadas = this.maxRetentativas + 1;
     const prazo = this._agora() + this.orcamentoTotalMs;
 
-    for (let tentativa = 1; tentativa <= totalDeChamadas; tentativa++) {
+    for (let tentativa = 1; tentativa < totalDeChamadas; tentativa++) {
       const tempoRestante = prazo - this._agora();
       if (tempoRestante <= 0) break;
killedBy: GatewayPagamentoClient respeita máximo de quatro chamadas e retorna fallback
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 4
Received number of calls: 3

[Killed] BlockStatement
src/infra/GatewayPagamentoClient.js:51:72
     const totalDeChamadas = this.maxRetentativas + 1;
     const prazo = this._agora() + this.orcamentoTotalMs;
 
-    for (let tentativa = 1; tentativa <= totalDeChamadas; tentativa++) {
-      const tempoRestante = prazo - this._agora();
-      if (tempoRestante <= 0) break;
-
-      try {
-        const respostaBruta = await this._chamarComTimeout(
-          pedido,
-          Math.min(this.timeoutMs, tempoRestante),
-        );
-        this.circuitBreaker.registrarSucesso();
-        return this._interpretar(respostaBruta);
-      } catch (erro) {
-        ultimaFalha = erro;
-        this.circuitBreaker.registrarFalha();
-
-        const backoff = this._calcularBackoff(tentativa);
-        const haveraNovaTentativa =
-          tentativa < totalDeChamadas &&
-          this._agora() + backoff < prazo;
-
-        if (haveraNovaTentativa) {
-          await this._aguardar(backoff);
-        }
-      }
-    }
+    for (let tentativa = 1; tentativa <= totalDeChamadas; tentativa++) {}
 
     return new PagamentoComErroInfraestrutura(
killedBy: GatewayPagamentoClient interpreta aprovação e recusa
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 500

[Killed] ArithmeticOperator
src/infra/GatewayPagamentoClient.js:52:29
     const prazo = this._agora() + this.orcamentoTotalMs;
 
     for (let tentativa = 1; tentativa <= totalDeChamadas; tentativa++) {
-      const tempoRestante = prazo - this._agora();
+      const tempoRestante = prazo + this._agora();
       if (tempoRestante <= 0) break;
 
killedBy: GatewayPagamentoClient não inicia chamada quando o orçamento total é zero
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 4

1: 3500, {"cvv": "123", "numero": "4111111111111111", "validade": "12/30"}
2: 3500, {"cvv": "123", "numero": "4111111111111111", "validade": "12/30"}
3: 3500, {"cvv": "123", "numero": "4111111111111111", "validade": "12/30"}

[Killed] EqualityOperator
src/infra/GatewayPagamentoClient.js:53:11
 
     for (let tentativa = 1; tentativa <= totalDeChamadas; tentativa++) {
       const tempoRestante = prazo - this._agora();
-      if (tempoRestante <= 0) break;
+      if (tempoRestante < 0) break;
 
       try {
killedBy: GatewayPagamentoClient não inicia chamada quando o orçamento total é zero
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 4

1: 3500, {"cvv": "123", "numero": "4111111111111111", "validade": "12/30"}
2: 3500, {"cvv": "123", "numero": "4111111111111111", "validade": "12/30"}
3: 3500, {"cvv": "123", "numero": "4111111111111111", "validade": "12/30"}

[Killed] ConditionalExpression
src/infra/GatewayPagamentoClient.js:53:11
 
     for (let tentativa = 1; tentativa <= totalDeChamadas; tentativa++) {
       const tempoRestante = prazo - this._agora();
-      if (tempoRestante <= 0) break;
+      if (true) break;
 
       try {
killedBy: GatewayPagamentoClient interpreta aprovação e recusa
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 500

[Killed] BlockStatement
src/infra/GatewayPagamentoClient.js:55:11
       const tempoRestante = prazo - this._agora();
       if (tempoRestante <= 0) break;
 
-      try {
-        const respostaBruta = await this._chamarComTimeout(
-          pedido,
-          Math.min(this.timeoutMs, tempoRestante),
-        );
-        this.circuitBreaker.registrarSucesso();
-        return this._interpretar(respostaBruta);
-      } catch (erro) {
+      try {} catch (erro) {
         ultimaFalha = erro;
         this.circuitBreaker.registrarFalha();
killedBy: GatewayPagamentoClient interpreta aprovação e recusa
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 500

[Killed] MethodExpression
src/infra/GatewayPagamentoClient.js:58:11
       try {
         const respostaBruta = await this._chamarComTimeout(
           pedido,
-          Math.min(this.timeoutMs, tempoRestante),
+          Math.max(this.timeoutMs, tempoRestante),
         );
         this.circuitBreaker.registrarSucesso();
killedBy: GatewayPagamentoClient interrompe chamada pendente no timeout
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Timeout: gateway de pagamento não respondeu em 5ms"
Received: "Timeout: gateway de pagamento não respondeu em 10ms"

[Killed] BlockStatement
src/infra/GatewayPagamentoClient.js:62:22
         );
         this.circuitBreaker.registrarSucesso();
         return this._interpretar(respostaBruta);
-      } catch (erro) {
-        ultimaFalha = erro;
-        this.circuitBreaker.registrarFalha();
-
-        const backoff = this._calcularBackoff(tentativa);
-        const haveraNovaTentativa =
-          tentativa < totalDeChamadas &&
-          this._agora() + backoff < prazo;
-
-        if (haveraNovaTentativa) {
-          await this._aguardar(backoff);
-        }
-      }
+      } catch (erro) {}
     }
 
killedBy: GatewayPagamentoClient repete com backoff exponencial e recupera na segunda chamada
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Array [
-   25,
- ]

[Killed] ConditionalExpression
src/infra/GatewayPagamentoClient.js:68:11
 
         const backoff = this._calcularBackoff(tentativa);
         const haveraNovaTentativa =
-          tentativa < totalDeChamadas &&
-          this._agora() + backoff < prazo;
+          false;
 
         if (haveraNovaTentativa) {
killedBy: GatewayPagamentoClient repete com backoff exponencial e recupera na segunda chamada
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Array [
-   25,
- ]

[Killed] EqualityOperator
src/infra/GatewayPagamentoClient.js:68:11
 
         const backoff = this._calcularBackoff(tentativa);
         const haveraNovaTentativa =
-          tentativa < totalDeChamadas &&
+          tentativa >= totalDeChamadas &&
           this._agora() + backoff < prazo;
 
killedBy: GatewayPagamentoClient repete com backoff exponencial e recupera na segunda chamada
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Array [
-   25,
- ]

[Killed] EqualityOperator
src/infra/GatewayPagamentoClient.js:69:11
         const backoff = this._calcularBackoff(tentativa);
         const haveraNovaTentativa =
           tentativa < totalDeChamadas &&
-          this._agora() + backoff < prazo;
+          this._agora() + backoff >= prazo;
 
         if (haveraNovaTentativa) {
killedBy: GatewayPagamentoClient repete com backoff exponencial e recupera na segunda chamada
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Array [
-   25,
- ]

[Survived] ArithmeticOperator
src/infra/GatewayPagamentoClient.js:69:11
         const backoff = this._calcularBackoff(tentativa);
         const haveraNovaTentativa =
           tentativa < totalDeChamadas &&
-          this._agora() + backoff < prazo;
+          this._agora() - backoff < prazo;
 
         if (haveraNovaTentativa) {

[Killed] BlockStatement
src/infra/GatewayPagamentoClient.js:71:34
           tentativa < totalDeChamadas &&
           this._agora() + backoff < prazo;
 
-        if (haveraNovaTentativa) {
-          await this._aguardar(backoff);
-        }
+        if (haveraNovaTentativa) {}
       }
     }
killedBy: GatewayPagamentoClient repete com backoff exponencial e recupera na segunda chamada
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Array [
-   25,
- ]

[Killed] ConditionalExpression
src/infra/GatewayPagamentoClient.js:71:13
           tentativa < totalDeChamadas &&
           this._agora() + backoff < prazo;
 
-        if (haveraNovaTentativa) {
+        if (false) {
           await this._aguardar(backoff);
         }
killedBy: GatewayPagamentoClient repete com backoff exponencial e recupera na segunda chamada
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Array [
-   25,
- ]

[Killed] BlockStatement
src/infra/GatewayPagamentoClient.js:82:31
     );
   }
 
-  _calcularBackoff(tentativa) {
-    const exponencial = this.intervaloBackoffMs * (2 ** (tentativa - 1));
-    return exponencial + Math.floor(this._aleatorio() * (this.jitterMs + 1));
-  }
+  _calcularBackoff(tentativa) {}
 
   _chamarComTimeout(pedido, timeoutMs) {
killedBy: GatewayPagamentoClient repete com backoff exponencial e recupera na segunda chamada
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Array [
-   25,
- ]

[Killed] ArithmeticOperator
src/infra/GatewayPagamentoClient.js:83:25
   }
 
   _calcularBackoff(tentativa) {
-    const exponencial = this.intervaloBackoffMs * (2 ** (tentativa - 1));
+    const exponencial = this.intervaloBackoffMs / 2 ** (tentativa - 1);
     return exponencial + Math.floor(this._aleatorio() * (this.jitterMs + 1));
   }
killedBy: GatewayPagamentoClient usa backoff exponencial e jitter nas tentativas sucessivas
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    25,
-   45,

[Killed] ArithmeticOperator
src/infra/GatewayPagamentoClient.js:83:58
   }
 
   _calcularBackoff(tentativa) {
-    const exponencial = this.intervaloBackoffMs * (2 ** (tentativa - 1));
+    const exponencial = this.intervaloBackoffMs * (2 ** (tentativa + 1));
     return exponencial + Math.floor(this._aleatorio() * (this.jitterMs + 1));
   }
killedBy: GatewayPagamentoClient repete com backoff exponencial e recupera na segunda chamada
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   25,
+   100,

[Killed] ArithmeticOperator
src/infra/GatewayPagamentoClient.js:84:12
 
   _calcularBackoff(tentativa) {
     const exponencial = this.intervaloBackoffMs * (2 ** (tentativa - 1));
-    return exponencial + Math.floor(this._aleatorio() * (this.jitterMs + 1));
+    return exponencial - Math.floor(this._aleatorio() * (this.jitterMs + 1));
   }
 
killedBy: GatewayPagamentoClient usa backoff exponencial e jitter nas tentativas sucessivas
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
-   25,
-   45,

[Killed] ArithmeticOperator
src/infra/GatewayPagamentoClient.js:84:37
 
   _calcularBackoff(tentativa) {
     const exponencial = this.intervaloBackoffMs * (2 ** (tentativa - 1));
-    return exponencial + Math.floor(this._aleatorio() * (this.jitterMs + 1));
+    return exponencial + Math.floor(this._aleatorio() / (this.jitterMs + 1));
   }
 
killedBy: GatewayPagamentoClient usa backoff exponencial e jitter nas tentativas sucessivas
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
-   25,
-   45,

[Killed] BlockStatement
src/infra/GatewayPagamentoClient.js:87:40
     return exponencial + Math.floor(this._aleatorio() * (this.jitterMs + 1));
   }
 
-  _chamarComTimeout(pedido, timeoutMs) {
-    const chamadaAoGateway = this.gatewayPagamento.cobrar(pedido.valor, pedido.cartao);
-
-    return new Promise((resolve, reject) => {
-      const idDoTimeout = setTimeout(() => reject(new TimeoutGatewayError(timeoutMs)), timeoutMs);
-
-      chamadaAoGateway.then(
-        (valor) => {
-          clearTimeout(idDoTimeout);
-          resolve(valor);
-        },
-        (erro) => {
-          clearTimeout(idDoTimeout);
-          reject(erro);
-        },
-      );
-    });
-  }
+  _chamarComTimeout(pedido, timeoutMs) {}
 
   _interpretar(respostaBruta) {
killedBy: GatewayPagamentoClient interpreta aprovação e recusa
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 402

[Timeout] BlockStatement
src/infra/GatewayPagamentoClient.js:90:45
   _chamarComTimeout(pedido, timeoutMs) {
     const chamadaAoGateway = this.gatewayPagamento.cobrar(pedido.valor, pedido.cartao);
 
-    return new Promise((resolve, reject) => {
-      const idDoTimeout = setTimeout(() => reject(new TimeoutGatewayError(timeoutMs)), timeoutMs);
-
-      chamadaAoGateway.then(
-        (valor) => {
-          clearTimeout(idDoTimeout);
-          resolve(valor);
-        },
-        (erro) => {
-          clearTimeout(idDoTimeout);
-          reject(erro);
-        },
-      );
-    });
+    return new Promise((resolve, reject) => {});
   }
 

[Killed] ArrowFunction
src/infra/GatewayPagamentoClient.js:91:38
     const chamadaAoGateway = this.gatewayPagamento.cobrar(pedido.valor, pedido.cartao);
 
     return new Promise((resolve, reject) => {
-      const idDoTimeout = setTimeout(() => reject(new TimeoutGatewayError(timeoutMs)), timeoutMs);
+      const idDoTimeout = setTimeout(() => undefined, timeoutMs);
 
       chamadaAoGateway.then(
killedBy: GatewayPagamentoClient interrompe chamada pendente no timeout
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] BlockStatement
src/infra/GatewayPagamentoClient.js:94:20
       const idDoTimeout = setTimeout(() => reject(new TimeoutGatewayError(timeoutMs)), timeoutMs);
 
       chamadaAoGateway.then(
-        (valor) => {
-          clearTimeout(idDoTimeout);
-          resolve(valor);
-        },
+        (valor) => {},
         (erro) => {
           clearTimeout(idDoTimeout);
killedBy: GatewayPagamentoClient interpreta aprovação e recusa
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 500

[Killed] BlockStatement
src/infra/GatewayPagamentoClient.js:98:19
           clearTimeout(idDoTimeout);
           resolve(valor);
         },
-        (erro) => {
-          clearTimeout(idDoTimeout);
-          reject(erro);
-        },
+        (erro) => {},
       );
     });
killedBy: GatewayPagamentoClient respeita máximo de quatro chamadas e retorna fallback
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 4
Received number of calls: 1

[Killed] BlockStatement
src/infra/GatewayPagamentoClient.js:106:31
     });
   }
 
-  _interpretar(respostaBruta) {
-    if (respostaBruta && respostaBruta.status === STATUS_APROVADO) {
-      return new PagamentoAprovado();
-    }
-    const motivo = (respostaBruta && (respostaBruta.motivo || respostaBruta.status)) || 'recusado';
-    return new PagamentoRecusado(motivo);
-  }
+  _interpretar(respostaBruta) {}
 }
 
killedBy: GatewayPagamentoClient interpreta aprovação e recusa
statusReason: TypeError: Cannot read properties of undefined (reading 'paraRespostaHttp')

[Killed] BlockStatement
src/infra/GatewayPagamentoClient.js:107:68
   }
 
   _interpretar(respostaBruta) {
-    if (respostaBruta && respostaBruta.status === STATUS_APROVADO) {
-      return new PagamentoAprovado();
-    }
+    if (respostaBruta && respostaBruta.status === STATUS_APROVADO) {}
     const motivo = (respostaBruta && (respostaBruta.motivo || respostaBruta.status)) || 'recusado';
     return new PagamentoRecusado(motivo);
killedBy: GatewayPagamentoClient interpreta aprovação e recusa
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 402

[Killed] ConditionalExpression
src/infra/GatewayPagamentoClient.js:107:26
   }
 
   _interpretar(respostaBruta) {
-    if (respostaBruta && respostaBruta.status === STATUS_APROVADO) {
+    if (respostaBruta && true) {
       return new PagamentoAprovado();
     }
killedBy: GatewayPagamentoClient interpreta aprovação e recusa
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 402
Received: 200

[Killed] LogicalOperator
src/infra/GatewayPagamentoClient.js:110:21
     if (respostaBruta && respostaBruta.status === STATUS_APROVADO) {
       return new PagamentoAprovado();
     }
-    const motivo = (respostaBruta && (respostaBruta.motivo || respostaBruta.status)) || 'recusado';
+    const motivo = (respostaBruta || respostaBruta.motivo || respostaBruta.status) || 'recusado';
     return new PagamentoRecusado(motivo);
   }
killedBy: GatewayPagamentoClient interpreta aprovação e recusa
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "limite"
Received: {"motivo": "limite", "status": "RECUSADO"}

[Killed] LogicalOperator
src/infra/GatewayPagamentoClient.js:110:39
     if (respostaBruta && respostaBruta.status === STATUS_APROVADO) {
       return new PagamentoAprovado();
     }
-    const motivo = (respostaBruta && (respostaBruta.motivo || respostaBruta.status)) || 'recusado';
+    const motivo = (respostaBruta && (respostaBruta.motivo && respostaBruta.status)) || 'recusado';
     return new PagamentoRecusado(motivo);
   }
killedBy: GatewayPagamentoClient interpreta aprovação e recusa
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "limite"
Received: "RECUSADO"

[Killed] ObjectLiteral
src/infra/GatewayPagamentoClient.js:115:18
   }
 }
 
-module.exports = { GatewayPagamentoClient, TimeoutGatewayError };
+module.exports = {};
 
killedBy: GatewayPagamentoClient interpreta aprovação e recusa
statusReason: TypeError: GatewayPagamentoClient is not a constructor
