[Killed] BlockStatement
src/domain/Pedido.js:13:36
  * do gateway, sabe também qual o novo status do pedido" em um único lugar.
  */
 class Pedido {
-  constructor(solicitacaoCheckout) {
-    this.clienteEmail = solicitacaoCheckout.clienteEmail;
-    this.valor = solicitacaoCheckout.valor;
-    this.cartao = solicitacaoCheckout.cartao;
-    this.status = StatusPedido.PENDENTE;
-  }
+  constructor(solicitacaoCheckout) {}
 
   marcarComo(status) {
killedBy: CheckoutService aprova, persiste e publica email sem aguardar a entrega
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"destinatario": "joao@email.com", "pedidoId": 10}
Received: {"destinatario": undefined, "mensagem": "Pagamento Aprovado", "pedidoId": 10}

Number of calls: 1

[Killed] BlockStatement
src/domain/Pedido.js:20:22
     this.status = StatusPedido.PENDENTE;
   }
 
-  marcarComo(status) {
-    this.status = status;
-  }
+  marcarComo(status) {}
 }
 
killedBy: API de checkout retorna 200 para pagamento aprovado
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "PROCESSADO"
Received: "PENDENTE"

[Killed] ObjectLiteral
src/domain/Pedido.js:25:18
   }
 }
 
-module.exports = { Pedido };
+module.exports = {};
killedBy: API de checkout retorna 200 para pagamento aprovado
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 500
