[Killed] Regex
src/domain/SolicitacaoCheckout.js:3:21
 const { DadosInvalidosError } = require('./erros/DadosInvalidosErro');
 
-const REGEX_EMAIL = /^[^\s@]+@[^\s@]+\.[a-zA-Z]{2,}$/;
+const REGEX_EMAIL = /[^\s@]+@[^\s@]+\.[a-zA-Z]{2,}$/;
 
 /**
killedBy: SolicitacaoCheckout rejeita payload inválido 1
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: DadosInvalidosError

Received function did not throw

[Killed] Regex
src/domain/SolicitacaoCheckout.js:3:21
 const { DadosInvalidosError } = require('./erros/DadosInvalidosErro');
 
-const REGEX_EMAIL = /^[^\s@]+@[^\s@]+\.[a-zA-Z]{2,}$/;
+const REGEX_EMAIL = /^[^\s@]+@[^\s@]\.[a-zA-Z]{2,}$/;
 
 /**
killedBy: API de checkout retorna 200 para pagamento aprovado
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 400

[Killed] BlockStatement
src/domain/SolicitacaoCheckout.js:18:44
  * passar pelo factory `criar`, que lança DadosInvalidosError.
  */
 class SolicitacaoCheckout {
-  constructor(clienteEmail, valor, cartao) {
-    this.clienteEmail = clienteEmail;
-    this.valor = valor;
-    this.cartao = cartao;
-  }
+  constructor(clienteEmail, valor, cartao) {}
 
   /**
killedBy: CheckoutService aprova, persiste e publica email sem aguardar a entrega
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"destinatario": "joao@email.com", "pedidoId": 10}
Received: {"destinatario": undefined, "mensagem": "Pagamento Aprovado", "pedidoId": 10}

Number of calls: 1

[Killed] BlockStatement
src/domain/SolicitacaoCheckout.js:28:30
    * Factory method: única porta de entrada para criar uma SolicitacaoCheckout
    * a partir de um payload bruto (ex: req.body). Garante o RN01.
    */
-  static criar(payload = {}) {
-    const motivos = SolicitacaoCheckout._validar(payload || {});
-
-    if (motivos.length > 0) {
-      throw new DadosInvalidosError(motivos);
-    }
-
-    const { clienteEmail, valor, cartao } = payload;
-    return new SolicitacaoCheckout(clienteEmail, valor, cartao);
-  }
+  static criar(payload = {}) {}
 
   static _validar({ clienteEmail, valor, cartao }) {
killedBy: API de checkout retorna 200 para pagamento aprovado
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 500

[Killed] ConditionalExpression
src/domain/SolicitacaoCheckout.js:29:50
    * a partir de um payload bruto (ex: req.body). Garante o RN01.
    */
   static criar(payload = {}) {
-    const motivos = SolicitacaoCheckout._validar(payload || {});
+    const motivos = SolicitacaoCheckout._validar(false);
 
     if (motivos.length > 0) {
killedBy: CheckoutService aprova, persiste e publica email sem aguardar a entrega
statusReason: DadosInvalidosError: Dados inválidos para checkout: clienteEmail ausente ou em formato inválido; valor deve ser numérico e maior que zero; cartao ausente ou incompleto (numero, validade e cvv são obrigatórios)

[Killed] LogicalOperator
src/domain/SolicitacaoCheckout.js:29:50
    * a partir de um payload bruto (ex: req.body). Garante o RN01.
    */
   static criar(payload = {}) {
-    const motivos = SolicitacaoCheckout._validar(payload || {});
+    const motivos = SolicitacaoCheckout._validar(payload && {});
 
     if (motivos.length > 0) {
killedBy: API de checkout retorna 200 para pagamento aprovado
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 400

[Killed] BlockStatement
src/domain/SolicitacaoCheckout.js:31:29
   static criar(payload = {}) {
     const motivos = SolicitacaoCheckout._validar(payload || {});
 
-    if (motivos.length > 0) {
-      throw new DadosInvalidosError(motivos);
-    }
+    if (motivos.length > 0) {}
 
     const { clienteEmail, valor, cartao } = payload;
killedBy: API de checkout retorna 400 e não acessa dependências para payload inválido
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 200

[Killed] ConditionalExpression
src/domain/SolicitacaoCheckout.js:31:9
   static criar(payload = {}) {
     const motivos = SolicitacaoCheckout._validar(payload || {});
 
-    if (motivos.length > 0) {
+    if (true) {
       throw new DadosInvalidosError(motivos);
     }
killedBy: CheckoutService aprova, persiste e publica email sem aguardar a entrega
statusReason: DadosInvalidosError: Dados inválidos para checkout:

[Killed] BlockStatement
src/domain/SolicitacaoCheckout.js:39:52
     return new SolicitacaoCheckout(clienteEmail, valor, cartao);
   }
 
-  static _validar({ clienteEmail, valor, cartao }) {
-    const motivos = [];
-
-    if (!SolicitacaoCheckout._emailValido(clienteEmail)) {
-      motivos.push('clienteEmail ausente ou em formato inválido');
-    }
-
-    if (!SolicitacaoCheckout._valorValido(valor)) {
-      motivos.push('valor deve ser numérico e maior que zero');
-    }
-
-    if (!SolicitacaoCheckout._cartaoValido(cartao)) {
-      motivos.push('cartao ausente ou incompleto (numero, validade e cvv são obrigatórios)');
-    }
-
-    return motivos;
-  }
+  static _validar({ clienteEmail, valor, cartao }) {}
 
   static _emailValido(clienteEmail) {
killedBy: API de checkout retorna 200 para pagamento aprovado
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 500

[Killed] ConditionalExpression
src/domain/SolicitacaoCheckout.js:42:9
   static _validar({ clienteEmail, valor, cartao }) {
     const motivos = [];
 
-    if (!SolicitacaoCheckout._emailValido(clienteEmail)) {
+    if (false) {
       motivos.push('clienteEmail ausente ou em formato inválido');
     }
killedBy: SolicitacaoCheckout rejeita payload inválido 0
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: DadosInvalidosError

Received function did not throw

[Killed] BooleanLiteral
src/domain/SolicitacaoCheckout.js:42:9
   static _validar({ clienteEmail, valor, cartao }) {
     const motivos = [];
 
-    if (!SolicitacaoCheckout._emailValido(clienteEmail)) {
+    if (SolicitacaoCheckout._emailValido(clienteEmail)) {
       motivos.push('clienteEmail ausente ou em formato inválido');
     }
killedBy: API de checkout retorna 200 para pagamento aprovado
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 400

[Killed] StringLiteral
src/domain/SolicitacaoCheckout.js:43:20
     const motivos = [];
 
     if (!SolicitacaoCheckout._emailValido(clienteEmail)) {
-      motivos.push('clienteEmail ausente ou em formato inválido');
+      motivos.push("");
     }
 
killedBy: SolicitacaoCheckout rejeita payload inválido 0
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "clienteEmail"
Received string:    ""

[Killed] BooleanLiteral
src/domain/SolicitacaoCheckout.js:46:9
       motivos.push('clienteEmail ausente ou em formato inválido');
     }
 
-    if (!SolicitacaoCheckout._valorValido(valor)) {
+    if (SolicitacaoCheckout._valorValido(valor)) {
       motivos.push('valor deve ser numérico e maior que zero');
     }
killedBy: API de checkout retorna 200 para pagamento aprovado
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 400

[Killed] ConditionalExpression
src/domain/SolicitacaoCheckout.js:46:9
       motivos.push('clienteEmail ausente ou em formato inválido');
     }
 
-    if (!SolicitacaoCheckout._valorValido(valor)) {
+    if (true) {
       motivos.push('valor deve ser numérico e maior que zero');
     }
killedBy: API de checkout retorna 200 para pagamento aprovado
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 400

[Killed] ConditionalExpression
src/domain/SolicitacaoCheckout.js:50:9
       motivos.push('valor deve ser numérico e maior que zero');
     }
 
-    if (!SolicitacaoCheckout._cartaoValido(cartao)) {
+    if (false) {
       motivos.push('cartao ausente ou incompleto (numero, validade e cvv são obrigatórios)');
     }
killedBy: SolicitacaoCheckout rejeita payload inválido 6
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: DadosInvalidosError

Received function did not throw

[Killed] ConditionalExpression
src/domain/SolicitacaoCheckout.js:50:9
       motivos.push('valor deve ser numérico e maior que zero');
     }
 
-    if (!SolicitacaoCheckout._cartaoValido(cartao)) {
+    if (true) {
       motivos.push('cartao ausente ou incompleto (numero, validade e cvv são obrigatórios)');
     }
killedBy: SolicitacaoCheckout aceita payload válido
statusReason: DadosInvalidosError: Dados inválidos para checkout: cartao ausente ou incompleto (numero, validade e cvv são obrigatórios)

[Killed] BlockStatement
src/domain/SolicitacaoCheckout.js:57:37
     return motivos;
   }
 
-  static _emailValido(clienteEmail) {
-    return typeof clienteEmail === 'string' && REGEX_EMAIL.test(clienteEmail);
-  }
+  static _emailValido(clienteEmail) {}
 
   static _valorValido(valor) {
killedBy: CheckoutService aprova, persiste e publica email sem aguardar a entrega
statusReason: DadosInvalidosError: Dados inválidos para checkout: clienteEmail ausente ou em formato inválido

[Killed] ConditionalExpression
src/domain/SolicitacaoCheckout.js:58:12
   }
 
   static _emailValido(clienteEmail) {
-    return typeof clienteEmail === 'string' && REGEX_EMAIL.test(clienteEmail);
+    return true;
   }
 
killedBy: SolicitacaoCheckout rejeita payload inválido 0
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: DadosInvalidosError

Received function did not throw

[Killed] LogicalOperator
src/domain/SolicitacaoCheckout.js:58:12
   }
 
   static _emailValido(clienteEmail) {
-    return typeof clienteEmail === 'string' && REGEX_EMAIL.test(clienteEmail);
+    return typeof clienteEmail === 'string' || REGEX_EMAIL.test(clienteEmail);
   }
 
killedBy: SolicitacaoCheckout rejeita payload inválido 0
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: DadosInvalidosError

Received function did not throw

[Killed] BlockStatement
src/domain/SolicitacaoCheckout.js:61:30
     return typeof clienteEmail === 'string' && REGEX_EMAIL.test(clienteEmail);
   }
 
-  static _valorValido(valor) {
-    return typeof valor === 'number' && Number.isFinite(valor) && valor > 0;
-  }
+  static _valorValido(valor) {}
 
   static _cartaoValido(cartao) {
killedBy: SolicitacaoCheckout aceita payload válido
statusReason: DadosInvalidosError: Dados inválidos para checkout: valor deve ser numérico e maior que zero

[Killed] EqualityOperator
src/domain/SolicitacaoCheckout.js:62:67
   }
 
   static _valorValido(valor) {
-    return typeof valor === 'number' && Number.isFinite(valor) && valor > 0;
+    return typeof valor === 'number' && Number.isFinite(valor) && valor <= 0;
   }
 
killedBy: API de checkout retorna 200 para pagamento aprovado
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 400

[Killed] ConditionalExpression
src/domain/SolicitacaoCheckout.js:62:67
   }
 
   static _valorValido(valor) {
-    return typeof valor === 'number' && Number.isFinite(valor) && valor > 0;
+    return typeof valor === 'number' && Number.isFinite(valor) && true;
   }
 
killedBy: SolicitacaoCheckout rejeita payload inválido 3
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: DadosInvalidosError

Received function did not throw

[Killed] BlockStatement
src/domain/SolicitacaoCheckout.js:65:32
     return typeof valor === 'number' && Number.isFinite(valor) && valor > 0;
   }
 
-  static _cartaoValido(cartao) {
-    return Boolean(cartao && cartao.numero && cartao.validade && cartao.cvv);
-  }
+  static _cartaoValido(cartao) {}
 }
 
killedBy: API de checkout retorna 200 para pagamento aprovado
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 400

[Killed] LogicalOperator
src/domain/SolicitacaoCheckout.js:66:20
   }
 
   static _cartaoValido(cartao) {
-    return Boolean(cartao && cartao.numero && cartao.validade && cartao.cvv);
+    return Boolean(cartao || cartao.numero && cartao.validade && cartao.cvv);
   }
 }
killedBy: SolicitacaoCheckout rejeita payload inválido 6
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: DadosInvalidosError
Received constructor: TypeError

Received message: "Cannot read properties of null (reading 'numero')"

      159 |     } else {

[Killed] LogicalOperator
src/domain/SolicitacaoCheckout.js:66:20
   }
 
   static _cartaoValido(cartao) {
-    return Boolean(cartao && cartao.numero && cartao.validade && cartao.cvv);
+    return Boolean(cartao && cartao.numero || cartao.validade && cartao.cvv);
   }
 }
killedBy: SolicitacaoCheckout rejeita payload inválido 6
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: DadosInvalidosError
Received constructor: TypeError

Received message: "Cannot read properties of null (reading 'validade')"

      159 |     } else {
