[Killed] ObjectLiteral
src/infra/CircuitBreaker.js:1:30
-const ESTADO = Object.freeze({
-  FECHADO: 'FECHADO',
-  ABERTO: 'ABERTO',
-  MEIO_ABERTO: 'MEIO_ABERTO',
-});
+const ESTADO = Object.freeze({});
 
 /**
killedBy: CircuitBreaker permanece fechado quando a taxa é igual a 50%
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] StringLiteral
src/infra/CircuitBreaker.js:2:12
 const ESTADO = Object.freeze({
-  FECHADO: 'FECHADO',
+  FECHADO: "",
   ABERTO: 'ABERTO',
   MEIO_ABERTO: 'MEIO_ABERTO',
killedBy: CircuitBreaker passa para meio-aberto após o tempo de reset e fecha com sucesso
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "FECHADO"
Received: ""

[Killed] StringLiteral
src/infra/CircuitBreaker.js:3:11
 const ESTADO = Object.freeze({
   FECHADO: 'FECHADO',
-  ABERTO: 'ABERTO',
+  ABERTO: "",
   MEIO_ABERTO: 'MEIO_ABERTO',
 });
killedBy: CircuitBreaker mantém somente a janela deslizante configurada
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "ABERTO"
Received: ""

[Killed] BlockStatement
src/infra/CircuitBreaker.js:21:115
  * com Jest fake timers, evitando testes lentos ou "flaky".
  */
 class CircuitBreaker {
-  constructor({ limiteAmostras = 10, limiteTaxaFalha = 0.5, tempoResetMs = 5000, agora = () => Date.now() } = {}) {
-    this.limiteAmostras = limiteAmostras;
-    this.limiteTaxaFalha = limiteTaxaFalha;
-    this.tempoResetMs = tempoResetMs;
-    this._agora = agora;
-
-    this._estado = ESTADO.FECHADO;
-    this._amostras = [];
-    this._abertoDesde = null;
-  }
+  constructor({ limiteAmostras = 10, limiteTaxaFalha = 0.5, tempoResetMs = 5000, agora = () => Date.now() } = {}) {}
 
   estaAberto() {
killedBy: GatewayPagamentoClient interpreta aprovação e recusa
statusReason: TypeError: Cannot read properties of undefined (reading 'push')

[Survived] ArrowFunction
src/infra/CircuitBreaker.js:21:90
  * com Jest fake timers, evitando testes lentos ou "flaky".
  */
 class CircuitBreaker {
-  constructor({ limiteAmostras = 10, limiteTaxaFalha = 0.5, tempoResetMs = 5000, agora = () => Date.now() } = {}) {
+  constructor({ limiteAmostras = 10, limiteTaxaFalha = 0.5, tempoResetMs = 5000, agora = () => undefined } = {}) {
     this.limiteAmostras = limiteAmostras;
     this.limiteTaxaFalha = limiteTaxaFalha;

[Killed] BlockStatement
src/infra/CircuitBreaker.js:32:16
     this._abertoDesde = null;
   }
 
-  estaAberto() {
-    if (this._estado !== ESTADO.ABERTO) {
-      return false;
-    }
-
-    const tempoDecorrido = this._agora() - this._abertoDesde;
-    if (tempoDecorrido >= this.tempoResetMs) {
-      this._estado = ESTADO.MEIO_ABERTO;
-      return false;
-    }
-
-    return true;
-  }
+  estaAberto() {}
 
   registrarSucesso() {
killedBy: GatewayPagamentoClient não chama a rede quando o circuit breaker está aberto
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "circuit_breaker_aberto"
Received: "Cannot read properties of undefined (reading 'then')"

[Killed] ConditionalExpression
src/infra/CircuitBreaker.js:33:9
   }
 
   estaAberto() {
-    if (this._estado !== ESTADO.ABERTO) {
+    if (true) {
       return false;
     }
killedBy: GatewayPagamentoClient não chama a rede quando o circuit breaker está aberto
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "circuit_breaker_aberto"
Received: "Cannot read properties of undefined (reading 'then')"

[Killed] EqualityOperator
src/infra/CircuitBreaker.js:33:9
   }
 
   estaAberto() {
-    if (this._estado !== ESTADO.ABERTO) {
+    if (this._estado === ESTADO.ABERTO) {
       return false;
     }
killedBy: GatewayPagamentoClient não chama a rede quando o circuit breaker está aberto
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "circuit_breaker_aberto"
Received: "Cannot read properties of undefined (reading 'then')"

[Killed] BooleanLiteral
src/infra/CircuitBreaker.js:34:14
 
   estaAberto() {
     if (this._estado !== ESTADO.ABERTO) {
-      return false;
+      return true;
     }
 
killedBy: GatewayPagamentoClient interpreta aprovação e recusa
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 500

[Killed] ArithmeticOperator
src/infra/CircuitBreaker.js:37:28
       return false;
     }
 
-    const tempoDecorrido = this._agora() - this._abertoDesde;
+    const tempoDecorrido = this._agora() + this._abertoDesde;
     if (tempoDecorrido >= this.tempoResetMs) {
       this._estado = ESTADO.MEIO_ABERTO;
killedBy: GatewayPagamentoClient não chama a rede quando o circuit breaker está aberto
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "circuit_breaker_aberto"
Received: "Cannot read properties of undefined (reading 'then')"

[Killed] EqualityOperator
src/infra/CircuitBreaker.js:38:9
     }
 
     const tempoDecorrido = this._agora() - this._abertoDesde;
-    if (tempoDecorrido >= this.tempoResetMs) {
+    if (tempoDecorrido < this.tempoResetMs) {
       this._estado = ESTADO.MEIO_ABERTO;
       return false;
killedBy: CircuitBreaker abre quando a taxa de falhas ultrapassa 50%
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/infra/CircuitBreaker.js:38:46
     }
 
     const tempoDecorrido = this._agora() - this._abertoDesde;
-    if (tempoDecorrido >= this.tempoResetMs) {
-      this._estado = ESTADO.MEIO_ABERTO;
-      return false;
-    }
+    if (tempoDecorrido >= this.tempoResetMs) {}
 
     return true;
killedBy: CircuitBreaker passa para meio-aberto após o tempo de reset e fecha com sucesso
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BooleanLiteral
src/infra/CircuitBreaker.js:40:14
     const tempoDecorrido = this._agora() - this._abertoDesde;
     if (tempoDecorrido >= this.tempoResetMs) {
       this._estado = ESTADO.MEIO_ABERTO;
-      return false;
+      return true;
     }
 
killedBy: CircuitBreaker passa para meio-aberto após o tempo de reset e fecha com sucesso
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
src/infra/CircuitBreaker.js:46:22
     return true;
   }
 
-  registrarSucesso() {
-    this._registrarAmostra(true);
-
-    if (this._estado === ESTADO.MEIO_ABERTO) {
-      this._fechar();
-    }
-  }
+  registrarSucesso() {}
 
   registrarFalha() {
killedBy: CircuitBreaker abre quando a taxa de falhas ultrapassa 50%
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BooleanLiteral
src/infra/CircuitBreaker.js:47:28
   }
 
   registrarSucesso() {
-    this._registrarAmostra(true);
+    this._registrarAmostra(false);
 
     if (this._estado === ESTADO.MEIO_ABERTO) {
killedBy: CircuitBreaker permanece fechado quando a taxa é igual a 50%
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] EqualityOperator
src/infra/CircuitBreaker.js:49:9
   registrarSucesso() {
     this._registrarAmostra(true);
 
-    if (this._estado === ESTADO.MEIO_ABERTO) {
+    if (this._estado !== ESTADO.MEIO_ABERTO) {
       this._fechar();
     }
killedBy: CircuitBreaker abre quando a taxa de falhas ultrapassa 50%
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/infra/CircuitBreaker.js:49:9
   registrarSucesso() {
     this._registrarAmostra(true);
 
-    if (this._estado === ESTADO.MEIO_ABERTO) {
+    if (true) {
       this._fechar();
     }
killedBy: CircuitBreaker abre quando a taxa de falhas ultrapassa 50%
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/infra/CircuitBreaker.js:54:20
     }
   }
 
-  registrarFalha() {
-    this._registrarAmostra(false);
-
-    if (this._estado === ESTADO.MEIO_ABERTO) {
-      this._abrir();
-      return;
-    }
-
-    if (this._janelaCompleta() && this._taxaDeFalhaAtual() > this.limiteTaxaFalha) {
-      this._abrir();
-    }
-  }
+  registrarFalha() {}
 
   estado() {
killedBy: GatewayPagamentoClient não chama a rede quando o circuit breaker está aberto
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "circuit_breaker_aberto"
Received: "Cannot read properties of undefined (reading 'then')"

[Killed] BooleanLiteral
src/infra/CircuitBreaker.js:55:28
   }
 
   registrarFalha() {
-    this._registrarAmostra(false);
+    this._registrarAmostra(true);
 
     if (this._estado === ESTADO.MEIO_ABERTO) {
killedBy: GatewayPagamentoClient não chama a rede quando o circuit breaker está aberto
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "circuit_breaker_aberto"
Received: "Cannot read properties of undefined (reading 'then')"

[Killed] EqualityOperator
src/infra/CircuitBreaker.js:62:35
       return;
     }
 
-    if (this._janelaCompleta() && this._taxaDeFalhaAtual() > this.limiteTaxaFalha) {
+    if (this._janelaCompleta() && this._taxaDeFalhaAtual() <= this.limiteTaxaFalha) {
       this._abrir();
     }
killedBy: GatewayPagamentoClient não chama a rede quando o circuit breaker está aberto
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "circuit_breaker_aberto"
Received: "Cannot read properties of undefined (reading 'then')"

[Killed] EqualityOperator
src/infra/CircuitBreaker.js:62:35
       return;
     }
 
-    if (this._janelaCompleta() && this._taxaDeFalhaAtual() > this.limiteTaxaFalha) {
+    if (this._janelaCompleta() && this._taxaDeFalhaAtual() >= this.limiteTaxaFalha) {
       this._abrir();
     }
killedBy: CircuitBreaker permanece fechado quando a taxa é igual a 50%
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
src/infra/CircuitBreaker.js:67:12
     }
   }
 
-  estado() {
-    return this._estado;
-  }
+  estado() {}
 
   _registrarAmostra(sucesso) {
killedBy: CircuitBreaker passa para meio-aberto após o tempo de reset e fecha com sucesso
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "MEIO_ABERTO"
Received: undefined

[Killed] BlockStatement
src/infra/CircuitBreaker.js:71:30
     return this._estado;
   }
 
-  _registrarAmostra(sucesso) {
-    this._amostras.push(sucesso);
-    if (this._amostras.length > this.limiteAmostras) {
-      this._amostras.shift();
-    }
-  }
+  _registrarAmostra(sucesso) {}
 
   _janelaCompleta() {
killedBy: GatewayPagamentoClient não chama a rede quando o circuit breaker está aberto
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "circuit_breaker_aberto"
Received: "Cannot read properties of undefined (reading 'then')"

[Killed] ConditionalExpression
src/infra/CircuitBreaker.js:73:9
 
   _registrarAmostra(sucesso) {
     this._amostras.push(sucesso);
-    if (this._amostras.length > this.limiteAmostras) {
+    if (false) {
       this._amostras.shift();
     }
killedBy: CircuitBreaker mantém somente a janela deslizante configurada
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "FECHADO"
Received: "ABERTO"

[Killed] BlockStatement
src/infra/CircuitBreaker.js:73:54
 
   _registrarAmostra(sucesso) {
     this._amostras.push(sucesso);
-    if (this._amostras.length > this.limiteAmostras) {
-      this._amostras.shift();
-    }
+    if (this._amostras.length > this.limiteAmostras) {}
   }
 
killedBy: CircuitBreaker mantém somente a janela deslizante configurada
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "FECHADO"
Received: "ABERTO"

[Killed] BlockStatement
src/infra/CircuitBreaker.js:78:21
     }
   }
 
-  _janelaCompleta() {
-    return this._amostras.length >= this.limiteAmostras;
-  }
+  _janelaCompleta() {}
 
   _taxaDeFalhaAtual() {
killedBy: CircuitBreaker abre quando a taxa de falhas ultrapassa 50%
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/infra/CircuitBreaker.js:79:12
   }
 
   _janelaCompleta() {
-    return this._amostras.length >= this.limiteAmostras;
+    return false;
   }
 
killedBy: GatewayPagamentoClient não chama a rede quando o circuit breaker está aberto
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "circuit_breaker_aberto"
Received: "Cannot read properties of undefined (reading 'then')"

[Killed] EqualityOperator
src/infra/CircuitBreaker.js:79:12
   }
 
   _janelaCompleta() {
-    return this._amostras.length >= this.limiteAmostras;
+    return this._amostras.length < this.limiteAmostras;
   }
 
killedBy: CircuitBreaker passa para meio-aberto após o tempo de reset e fecha com sucesso
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/infra/CircuitBreaker.js:82:23
     return this._amostras.length >= this.limiteAmostras;
   }
 
-  _taxaDeFalhaAtual() {
-    const falhas = this._amostras.filter((amostra) => !amostra).length;
-    return falhas / this._amostras.length;
-  }
+  _taxaDeFalhaAtual() {}
 
   _abrir() {
killedBy: GatewayPagamentoClient não chama a rede quando o circuit breaker está aberto
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "circuit_breaker_aberto"
Received: "Cannot read properties of undefined (reading 'then')"

[Killed] BooleanLiteral
src/infra/CircuitBreaker.js:83:55
   }
 
   _taxaDeFalhaAtual() {
-    const falhas = this._amostras.filter((amostra) => !amostra).length;
+    const falhas = this._amostras.filter((amostra) => amostra).length;
     return falhas / this._amostras.length;
   }
killedBy: GatewayPagamentoClient não chama a rede quando o circuit breaker está aberto
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "circuit_breaker_aberto"
Received: "Cannot read properties of undefined (reading 'then')"

[Killed] ArrowFunction
src/infra/CircuitBreaker.js:83:42
   }
 
   _taxaDeFalhaAtual() {
-    const falhas = this._amostras.filter((amostra) => !amostra).length;
+    const falhas = this._amostras.filter(() => undefined).length;
     return falhas / this._amostras.length;
   }
killedBy: GatewayPagamentoClient não chama a rede quando o circuit breaker está aberto
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "circuit_breaker_aberto"
Received: "Cannot read properties of undefined (reading 'then')"

[Killed] ArithmeticOperator
src/infra/CircuitBreaker.js:84:12
 
   _taxaDeFalhaAtual() {
     const falhas = this._amostras.filter((amostra) => !amostra).length;
-    return falhas / this._amostras.length;
+    return falhas * this._amostras.length;
   }
 
killedBy: CircuitBreaker permanece fechado quando a taxa é igual a 50%
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
src/infra/CircuitBreaker.js:87:12
     return falhas / this._amostras.length;
   }
 
-  _abrir() {
-    this._estado = ESTADO.ABERTO;
-    this._abertoDesde = this._agora();
-  }
+  _abrir() {}
 
   _fechar() {
killedBy: GatewayPagamentoClient não chama a rede quando o circuit breaker está aberto
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "circuit_breaker_aberto"
Received: "Cannot read properties of undefined (reading 'then')"

[Killed] BlockStatement
src/infra/CircuitBreaker.js:92:13
     this._abertoDesde = this._agora();
   }
 
-  _fechar() {
-    this._estado = ESTADO.FECHADO;
-    this._amostras = [];
-    this._abertoDesde = null;
-  }
+  _fechar() {}
 }
 
killedBy: CircuitBreaker passa para meio-aberto após o tempo de reset e fecha com sucesso
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "FECHADO"
Received: "MEIO_ABERTO"

[Survived] ArrayDeclaration
src/infra/CircuitBreaker.js:94:22
 
   _fechar() {
     this._estado = ESTADO.FECHADO;
-    this._amostras = [];
+    this._amostras = ["Stryker was here"];
     this._abertoDesde = null;
   }
