[Killed] BlockStatement
src/resultados/PagamentoAprovado.js:6:29
 
 class PagamentoAprovado extends ResultadoPagamento {
 
-    atualizarPedido(pedido) {
-
-        pedido.marcarComo(StatusPedido.PROCESSADO);
-
-    }
+    atualizarPedido(pedido) {}
 
     deveEnviarEmailConfirmacao() {
killedBy: API de checkout retorna 200 para pagamento aprovado
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "PROCESSADO"
Received: "PENDENTE"

[Killed] BlockStatement
src/resultados/PagamentoAprovado.js:12:34
 
     }
 
-    deveEnviarEmailConfirmacao() {
-        return true;
-    }
+    deveEnviarEmailConfirmacao() {}
 
     paraRespostaHttp(pedido) {
killedBy: API de checkout retorna 200 para pagamento aprovado
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] BooleanLiteral
src/resultados/PagamentoAprovado.js:13:16
     }
 
     deveEnviarEmailConfirmacao() {
-        return true;
+        return false;
     }
 
killedBy: API de checkout retorna 200 para pagamento aprovado
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] BlockStatement
src/resultados/PagamentoAprovado.js:16:30
         return true;
     }
 
-    paraRespostaHttp(pedido) {
-
-        return {
-            httpStatus: 200,
-            pedido
-        };
-
-    }
+    paraRespostaHttp(pedido) {}
 
 }
killedBy: GatewayPagamentoClient interpreta aprovação e recusa
statusReason: TypeError: Cannot read properties of undefined (reading 'httpStatus')

[Killed] ObjectLiteral
src/resultados/PagamentoAprovado.js:27:18
 
 }
 
-module.exports = {
-    PagamentoAprovado
-};
+module.exports = {};
 
killedBy: API de checkout retorna 200 para pagamento aprovado
statusReason: TypeError: PagamentoAprovado is not a constructor
