[Killed] BlockStatement
src/resultados/PagamentoComErroInfraestrutura.js:6:23
 
 class PagamentoComErroInfraestrutura extends ResultadoPagamento {
 
-    constructor(erro) {
-
-        super();
-
-        this.erro = erro;
-
-    }
+    constructor(erro) {}
 
     atualizarPedido(pedido) {
killedBy: API de checkout retorna 500 controlado para infraestrutura indisponível
statusReason: ReferenceError: Must call super constructor in derived class before accessing 'this' or returning from derived constructor

[Killed] BlockStatement
src/resultados/PagamentoComErroInfraestrutura.js:14:29
 
     }
 
-    atualizarPedido(pedido) {
-
-        pedido.marcarComo(StatusPedido.ERRO_GATEWAY);
-
-    }
+    atualizarPedido(pedido) {}
 
     deveEnviarEmailConfirmacao() {
killedBy: API de checkout retorna 500 controlado para infraestrutura indisponível
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "ERRO_GATEWAY"
Received: "PENDENTE"

[Killed] BlockStatement
src/resultados/PagamentoComErroInfraestrutura.js:20:34
 
     }
 
-    deveEnviarEmailConfirmacao() {
-
-        return false;
-
-    }
+    deveEnviarEmailConfirmacao() {}
 
     paraRespostaHttp() {
killedBy: CheckoutService resultados de falha declaram explicitamente que não enviam email
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: undefined

[Killed] BlockStatement
src/resultados/PagamentoComErroInfraestrutura.js:26:24
 
     }
 
-    paraRespostaHttp() {
-
-        return {
-
-            httpStatus: 500,
-
-            erro: this.erro
-
-        };
-
-    }
+    paraRespostaHttp() {}
 
 }
killedBy: API de checkout retorna 500 controlado para infraestrutura indisponível
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "ERRO_GATEWAY"
Received: undefined

[Killed] ObjectLiteral
src/resultados/PagamentoComErroInfraestrutura.js:40:18
 
 }
 
-module.exports = {
-    PagamentoComErroInfraestrutura
-};
+module.exports = {};
 
killedBy: GatewayPagamentoClient respeita máximo de quatro chamadas e retorna fallback
statusReason: TypeError: PagamentoComErroInfraestrutura is not a constructor
