[Killed] BlockStatement
src/resultados/PagamentoRecusado.js:6:25
 
 class PagamentoRecusado extends ResultadoPagamento {
 
-    constructor(motivo) {
-
-        super();
-
-        this.motivo = motivo;
-
-    }
+    constructor(motivo) {}
 
     atualizarPedido(pedido) {
killedBy: GatewayPagamentoClient interpreta aprovação e recusa
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 402
Received: 500

[Killed] BlockStatement
src/resultados/PagamentoRecusado.js:14:29
 
     }
 
-    atualizarPedido(pedido) {
-
-        pedido.marcarComo(StatusPedido.FALHOU);
-
-    }
+    atualizarPedido(pedido) {}
 
     deveEnviarEmailConfirmacao() {
killedBy: CheckoutService recusa com 402, persiste e não publica email
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "FALHOU"
Received: "PENDENTE"

[Killed] BlockStatement
src/resultados/PagamentoRecusado.js:26:24
 
     }
 
-    paraRespostaHttp() {
-
-        return {
-
-            httpStatus: 402,
-
-            erro: this.motivo
-
-        };
-
-    }
+    paraRespostaHttp() {}
 
 }
killedBy: GatewayPagamentoClient interpreta aprovação e recusa
statusReason: TypeError: Cannot read properties of undefined (reading 'httpStatus')
