[Killed] BlockStatement
src/services/CheckoutService.js:5:96
 
 class CheckoutService {
 
-    constructor(gatewayPagamentoClient, pedidoRepository, filaEmail, configuracaoCache = null) {
-        this.gatewayPagamentoClient = gatewayPagamentoClient;
-        this.pedidoRepository = pedidoRepository;
-        this.filaEmail = filaEmail;
-        this.configuracaoCache = configuracaoCache;
-    }
+    constructor(gatewayPagamentoClient, pedidoRepository, filaEmail, configuracaoCache = null) {}
 
     async processar(pedido) {
killedBy: CheckoutService aprova, persiste e publica email sem aguardar a entrega
statusReason: TypeError: Cannot read properties of undefined (reading 'salvar')

[Killed] BlockStatement
src/services/CheckoutService.js:12:29
         this.configuracaoCache = configuracaoCache;
     }
 
-    async processar(pedido) {
-
-        let resultado;
-
-        try {
-
-            if (this.configuracaoCache) {
-                await this.configuracaoCache.obter();
-            }
-
-            resultado = await this.gatewayPagamentoClient.cobrar(pedido);
-
-        } catch (erro) {
-
-            resultado = new PagamentoComErroInfraestrutura(
-                erro.message
-            );
-
-        }
-
-        return this.finalizarPedido(
-            pedido,
-            resultado
-        );
-    }
+    async processar(pedido) {}
 
     async finalizarPedido(pedido, resultado) {
killedBy: API de checkout retorna 200 para pagamento aprovado
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 500

[Killed] BlockStatement
src/services/CheckoutService.js:16:13
 
         let resultado;
 
-        try {
-
-            if (this.configuracaoCache) {
-                await this.configuracaoCache.obter();
-            }
-
-            resultado = await this.gatewayPagamentoClient.cobrar(pedido);
-
-        } catch (erro) {
+        try {} catch (erro) {
 
             resultado = new PagamentoComErroInfraestrutura(
killedBy: API de checkout retorna 200 para pagamento aprovado
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 500

[Killed] ConditionalExpression
src/services/CheckoutService.js:18:17
 
         try {
 
-            if (this.configuracaoCache) {
+            if (true) {
                 await this.configuracaoCache.obter();
             }
killedBy: CheckoutService aprova, persiste e publica email sem aguardar a entrega
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 500

[Killed] BlockStatement
src/services/CheckoutService.js:18:41
 
         try {
 
-            if (this.configuracaoCache) {
-                await this.configuracaoCache.obter();
-            }
+            if (this.configuracaoCache) {}
 
             resultado = await this.gatewayPagamentoClient.cobrar(pedido);
killedBy: CheckoutService consulta configuração antes de cobrar
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 0

  Array [
-   "config",
    "gateway",

[Killed] BlockStatement
src/services/CheckoutService.js:24:24
 
             resultado = await this.gatewayPagamentoClient.cobrar(pedido);
 
-        } catch (erro) {
-
-            resultado = new PagamentoComErroInfraestrutura(
-                erro.message
-            );
-
-        }
+        } catch (erro) {}
 
         return this.finalizarPedido(
killedBy: CheckoutService converte exceção inesperada do gateway em falha controlada
statusReason: TypeError: Cannot read properties of undefined (reading 'atualizarPedido')

[Killed] BlockStatement
src/services/CheckoutService.js:38:46
         );
     }
 
-    async finalizarPedido(pedido, resultado) {
-
-        resultado.atualizarPedido(pedido);
-
-        await this.pedidoRepository.salvar(pedido);
-
-        if (resultado.deveEnviarEmailConfirmacao() && this.filaEmail) {
-            Promise.resolve(this.filaEmail.publicar({
-                pedidoId: pedido.id,
-                destinatario: pedido.clienteEmail,
-                mensagem: "Pagamento Aprovado"
-            })).catch(() => {
-                // O pagamento já foi persistido. O worker/DLQ trata falhas da notificação.
-            });
-        }
-
-        return resultado.paraRespostaHttp(pedido);
-
-    }
+    async finalizarPedido(pedido, resultado) {}
 
 }
killedBy: CheckoutService aprova, persiste e publica email sem aguardar a entrega
statusReason: TypeError: Cannot read properties of undefined (reading 'httpStatus')

[Killed] ConditionalExpression
src/services/CheckoutService.js:44:13
 
         await this.pedidoRepository.salvar(pedido);
 
-        if (resultado.deveEnviarEmailConfirmacao() && this.filaEmail) {
+        if (true) {
             Promise.resolve(this.filaEmail.publicar({
                 pedidoId: pedido.id,
killedBy: CheckoutService recusa com 402, persiste e não publica email
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: {"destinatario": "joao@email.com", "mensagem": "Pagamento Aprovado", "pedidoId": 10}

[Killed] BlockStatement
src/services/CheckoutService.js:44:71
 
         await this.pedidoRepository.salvar(pedido);
 
-        if (resultado.deveEnviarEmailConfirmacao() && this.filaEmail) {
-            Promise.resolve(this.filaEmail.publicar({
-                pedidoId: pedido.id,
-                destinatario: pedido.clienteEmail,
-                mensagem: "Pagamento Aprovado"
-            })).catch(() => {
-                // O pagamento já foi persistido. O worker/DLQ trata falhas da notificação.
-            });
-        }
+        if (resultado.deveEnviarEmailConfirmacao() && this.filaEmail) {}
 
         return resultado.paraRespostaHttp(pedido);
killedBy: API de checkout retorna 200 para pagamento aprovado
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0
