[Killed] ObjectLiteral
src/domain/StatusPedido.js:7:36
  * Elimina o "Magic String Smell" do código legado, onde strings como
  * 'PROCESSADO' e 'FALHOU' apareciam espalhadas e duplicadas pelo serviço.
  */
-const StatusPedido = Object.freeze({
-  PENDENTE: 'PENDENTE',
-  PROCESSADO: 'PROCESSADO',
-  FALHOU: 'FALHOU',
-  ERRO_GATEWAY: 'ERRO_GATEWAY',
-});
+const StatusPedido = Object.freeze({});
 
 module.exports = { StatusPedido };
killedBy: API de checkout retorna 200 para pagamento aprovado
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "PROCESSADO"
Received: undefined
